cheldonec/Guition-JC4880P443-Easy-Start/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FLASH_LOAD_TO_PSRAM=y
#CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
#CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152
CONFIG_SPIRAM_MEMTEST=n

#CONFIG_COMPILER_OPTIMIZATION_PERF=y
#CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=3584
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=n
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_VFS_MAX_COUNT=15
#CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
#CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
#CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE=y
#CONFIG_ESP_BROOKESIA_LOG_STYLE_STD=y
#CONFIG_ESP_BROOKESIA_MEMORY_USE_CUSTOM=y
#CONFIG_CAMERA_OV02C10=y
#CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=n
#CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
#CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
#CONFIG_WIFI_RMT_RX_BA_WIN=6
#CONFIG_LV_COLOR_SCREEN_TRANSP=y
#CONFIG_LV_MEM_CUSTOM=y
#CONFIG_LV_MEM_CUSTOM_INCLUDE="esp_heap_caps.h"
#CONFIG_LV_MEMCPY_MEMSET_STD=y
#CONFIG_LV_CIRCLE_CACHE_SIZE=10
#CONFIG_LV_LAYER_SIMPLE_BUF_SIZE=102400
#CONFIG_LV_IMG_CACHE_DEF_SIZE=20
#CONFIG_LV_GRAD_CACHE_DEF_SIZE=10240
#CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

#test
#CONFIG_LV_DRAW_LAYER_SIMPLE_BUF_SIZE=24576

CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
#
# Audio Codec Device Configuration
#
# CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE is not set
CONFIG_CODEC_ES8311_SUPPORT=y
CONFIG_CODEC_ES7210_SUPPORT=n
CONFIG_CODEC_ES7243_SUPPORT=n
CONFIG_CODEC_ES7243E_SUPPORT=n
CONFIG_CODEC_ES8156_SUPPORT=n
CONFIG_CODEC_AW88298_SUPPORT=n
CONFIG_CODEC_ES8389_SUPPORT=n
CONFIG_CODEC_ES8374_SUPPORT=n
CONFIG_CODEC_ES8388_SUPPORT=n
CONFIG_CODEC_TAS5805M_SUPPORT=n

#CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_ESP_HOSTED_USE_MEMPOOL=y
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y

CONFIG_ESP_WIFI_SSID="AndroidAP"
CONFIG_ESP_WIFI_PASSWORD="11111111"
